<div id="content"> 

            <h1>Поступление</h1>
        <p class="text-justify">Набор учащихся 7-11 классов производится по результатам школьных олимпиад различного уровня, а также по рекомендациям школьных преподавателей после собеседования. При поступлении на курсы происходит проверка уровня подготовки потенциального участника.</p>
        <p class="text-justify">Также для подготовки юных программистов организаторы проводят летнюю школу по математике и программированию. Возможность посещать школу есть у школьников, окончивших 7-10 класс и желающих получить углубленные знания в области программирования. Курс обучения предполагает знания в объёме школьной программы. Занятия по программированию проводятся преподавателями и студентами кафедры информатики. При обучении делается упор на алгоритмические аспекты программирования, в качестве базовых языков используются Паскаль и C++. Практические занятия в основном имеют форму решения задач олимпиадного типа в системе проверки заданий CATS. На основании результатов летней школы проводится отбор с среднюю и старшую группу мастер-класса.
        </p>

        <h1>Ступени</h1>
    <h3>Подготовительная ступень</h3>
    <p class="text-justify">Данная ступень является обязательной. В группу попадают неподготовленные участники, не имеющие никакой начальной базы по программированию. На протяжении всего курса ребята изучают простейшие команды на языках Basic Pascal и С++, проходят типы переменных, основные понятия программирования и прочее, необходимое для дальнейшей работы. Практические занятия в основном имеют форму решения задач олимпиадного типа в системе проверки заданий CATS. Полностью закончив данный курс, участники проходят тестирование, после чего руководитель принимает решение о переводе участников в следующую ступень.
        <br></p>
    <h3>Начальная ступень</h3>
    <p class="text-justify">Данный курс включает изучение следующих разделов:
    </p><ul>
        <li>язык (ветвления, циклы, работа с файлами, среды разработки)</li>
        <li>функции, рекурсия</li>
        <li>перебор</li>
        <li>сортировка, поиск, кучи (сортировки обменом, пузырьком, вставками, быстрая сортировка, сортировка слиянием, куча, сортировка с помощью кучи, бинарный поиск)</li>
        <li>геометрические алгоритмы (точки, прямые, отрезки, их взаимное расположение, многоугольники и связанные с ними задачи)</li>
        <li>комбинаторика (основные понятия, генерация комбинаторных объектов)</li>
        <li>структуры данных, динамическая память, записи (связные списки, деревья, их реализация в статически выделенной памяти)</li>
        <li>жадные алгоритмы</li>
        <li>динамическое программирование</li>
        <li>графы (основные понятия, представление графа в памяти, обход в глубину, обход в ширину, связные компоненты)</li>
    </ul>
    <p></p>
    <h3>Высшая ступень</h3>
    <p class="text-justify">На данной ступени обучаются уже состоявшиеся программисты, прошедшие предыдущие две ступени подготовки. Учебная программа состоит из сложных задач, составленных либо преподавательским составом кафедры, либо заимствованных из различных олимпиад и чемпионатов по программированию. Обучающиеся в этой ступени студенты участвуют в олимпиадах высшего уровня (всероссийские, международные). 
    </p>
</div>						