			<div id="content"> 
			<h1>О мастер-классе</h1>
		<p class="text-justify">Ежегодно университет выпускает специалистов в области информационных технологий.
		Но мало кто знает, что истинные умы появляются не сразу, а долгие годы совершенствуются на курсах программирования,
		организованными кафедрой информатики, математического и компьютерного моделирования.
		Набор учащихся 7-11 классов производится по результатам летней школы, школьных олимпиад различного уровня, а также по рекомендациям школьных преподавателей после собеседования. При поступлении на курсы происходит проверка уровня подготовки потенциального участника, после чего его определяют в одну из трех ступеней.
		</p>

		<img src="/img/article.jpg"  class="img-responsive img-rounded center-block"> </div>